# Курс: Поколение Python (для начинающих)
# Модуль 4.1: Выбор из двух
# Задача: Наименьшее из четырёх чисел

# УСЛОВИЕ:
# Напишите программу, которая определяет наименьшее из четырёх чисел.
# 
# Формат входных данных:
# На вход программе подаются четыре целых числа.
# 
# Формат выходных данных:
# Программа должна вывести наименьшее из четырёх чисел.

# Считываем 4 целых числа
n1, n2, n3, n4 = int(input()), int(input()), int(input()), int(input())

# Предполагаем, что первое число — наименьшее
minimum = n1

# Сравниваем с остальными числами и обновляем минимум
if minimum > n2:
    minimum = n2
if minimum > n3:
    minimum = n3
if minimum > n4:
    minimum = n4

# Выводим наименьшее число
print(minimum)