# Курс: Поколение Python (для начинающих)
# Модуль 4.2: Логические операции
# Задача: Ход короля

# УСЛОВИЕ:
# Даны две различные клетки шахматной доски. Напишите программу, которая
# определяет, может ли король попасть с первой клетки на вторую одним ходом.
# 
# Формат входных данных:
# На вход программе подаются четыре числа от 1 до 8 каждое, задающие номер
# столбца и номер строки сначала для первой клетки, потом для второй клетки.
# 
# Формат выходных данных:
# Программа должна вывести «YES», если из первой клетки ходом
# короля можно попасть во вторую, или «NO» в противном случае.

# Считываем координаты первой и второй клеток
x1, y1 = int(input()), int(input())
x2, y2 = int(input()), int(input())

# Король ходит на 1 клетку во всех направлениях.
# Разница между x1 и x2, а также y1 и y2 должна быть от -1 до 1.
if -1 <= x1 - x2 <= 1 and -1 <= y1 - y2 <= 1:
    print('YES')
else:
    print('NO')