# Курс: Поколение Python (для начинающих)
# Модуль 2.5: Целочисленная арифметика. Часть 2
# Задача: Номер купе

# УСЛОВИЕ:
# В купейном вагоне имеется 9 купе с четырьмя местами для пассажиров в каждом.
# Напишите программу, которая определяет номер купе, в котором находится место
# с заданным номером (нумерация мест сквозная, начинается с 1).
# 
# Формат входных данных:
# На вход программе подаётся целое число — место с заданным номером в вагоне.
# 
# Формат выходных данных:
# Программа должна вывести одно число — номер купе, в котором находится место.

# Считываем номер места
n = int(input())

# Формула округления деления вверх в Python: -(-n // 4)
# Позволяет узнать номер купе (каждые 4 места — новое купе)
print(-(-n // 4))